"""
1)Создайте функцию, которая будет принимать 2 числа, складывать их и возвращать результат сложения.
"""
# a = int(input('Введите число a: '))
# b = int(input('Введите число b: '))
# print('Результат:',(a+b))

"""
2) Создайте функцию, которая будет принимать строку.
Функция должна выводить длину этой строки.
"""
# a = input('Введите слово: ')
# count = len(a)
# print(count)

"""
3)Создайте функцию, которая принимает два обязательных параметра.
Задача этой функции выводить тип принятых аргументов.
"""
# arg1 = input('Введите данные a: ')
# arg2 = input('Введите данные b: ')
# def print_argument_types(arg1,arg2):
#     print('Тип аргумента a:', type(arg1))
#     print('Тип аргумента b:', type(arg2))
#     print()

"""
4)Создайте функцию, которая должна принимать 2 числа и возвращать результат их деления.
"""
# a = int(input('Введите число a: '))
# b = int(input('Введите число b: '))
# def divide_numbers(a,b):
#     if b != 0:
#         result = a/b
#         return result
#     else:
#         print('Ошибка деления на 0')
#         return None
#     print(result)
"""
5)Создайте функцию, которая принимает словарь. 
Пройдитесь по словарю циклом и распечатайте все его ключи
"""
# def print_dict_keys(dictionary):
#     for key in dictionary.keys():
#         print(key)
# country = {'code': 'RU', 'name': 'Russia', 'population': 144}
# print(country.keys())

"""
6) Создайте функцию, которая принимает и выводит 
"It's odd number" если это число не кратно двум 
и "It's even number" в противном случае.
"""


"""
7) Напишите функцию, которая будет принимать строку и проверять 
является ли она палиндромом. Пробелы и регистр учитывать не нужно.
(Палиндро́м, пе́ревертень — число, буквосочетание, слово или текст, 
одинаково читающееся в обоих направлениях. 
Например, число 101; слова "кок", "топот", "комок" и т.д.)
"""


"""
8) Создайте функцию которая принимает от пользователя два числа. 
Она должна сравнить эти числа между собой и вывести максимальное значение.
"""


"""
9) Напишите функцию, которая принимает список чисел и возвращает их произведение.
"""


"""
10) Напишите функцию, которая принимает целое число и возвращает сумму всех его цифр.
"""